["3 logicians walk into a bar. The bartender asks: Do all of you want a drink? The first logician says \"I don't know\". The second logician says \"I don't know\" the third logician says \"Yes!\"", "There are only 10 types of people in the world: those that understand binary and those that don’t.", "Computers make very fast and very accurate mistakes.", "Be nice to the nerds; for all you know they might be the next Bill Gates!", "Artificial intelligence usually beats real stupidity.", "To err is human – and to blame it on a computer is even more so.", "CAPS LOCK – Preventing Login Since 1980.", "The truth is out there. Anybody got the URL?", "The Internet: where men are men women are men and children are FBI agents.", "Some things Man was never meant to know. For everything else there’s Google.", "The box said ‘Requires Windows Vista or better’. So I installed LINUX.", "UNIX is basically a simple operating system... but you have to be a genius to understand the simplicity.", "In a world without fences and walls... who needs Gates and Windows?", "C://dos  <br>C://dos.run  <br>run.dos.run", "Bugs come in through open Windows.", "Penguins love cold... they wont survive the sun.", "Unix is user friendly. It’s just selective about who its friends are.", "Failure is not an option. It comes bundled with your Microsoft product.", "NT is the only OS that has caused me to beat a piece of hardware to death with my bare hands.", "My daily Unix command list: unzip; strip; touch; finger; mount; fsck; more; yes; unmount; sleep.", "Microsoft: “You’ve got questions. We’ve got dancing paperclips.”", "Erik Naggum: “Microsoft is not the answer. Microsoft is the question. NO is the answer.”", "Windows isn’t a virus atleast viruses do something.", "Computers are like air conditioners: they stop working when you open Windows.", "Mac users swear by their Mac and PC users swear at their PC.", "If at first you don’t succeed; call it version 1.0.", "My software never has bugs. It just develops random features.", "I would love to change the world but they won’t give me the source code.", "The code that is the hardest to debug is the code that you know cannot possibly be wrong.", "Beware of programmers that carry screwdrivers.", "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs and the Universe trying to produce bigger and better idiots. So far the Universe is winning.", "The beginning of the programmer’s wisdom is understanding the difference between getting program to run and having a runnable program.", "I’m not anti-social; I’m just not user friendly.", "Hey! It compiles! Ship it!", "If Ruby is not and Perl is the answer then you don’t understand the question.", "The more I C.... the less I see.", "COBOL programmers understand why women hate periods.", "Michael Sinz: “Programming is like sex... one mistake and you have to support it for the rest of your life.”", "If you give someone a program... you will frustrate them for a day; if you teach them how to program... you will frustrate them for a lifetime.", "Programmers are tools for converting caffeine into code.", "My attitude isn’t bad. It’s in beta.", "Enter any 11-digit prime number to continue.", "E-mail returned to sender... insufficient voltage.", "All wiyht. Rho sritched mg kegtops awound?", "Black holes are where God divided by zero.", "If I wanted a warm fuzzy feeling... I’d antialias my graphics!", "If brute force doesn’t solve your problems... then you aren’t using enough.", "SUPERCOMPUTER: what it sounded like before you bought it.", "Evolution is God’s way of issuing upgrades.", "Linus Torvalds: “Real men don’t use backups... they post their stuff on a public ftp server and let the rest of the world make copies.”", "Hacking is like sex. You get in... you get out... and hope that you didn’t leave something that can be traced back to you.", "There are three kinds of people: those who can count and those who can’t.", "Latest survey shows that 3 out of 4 people make up 75% of the world’s population.", "Hand over the calculator... friends don’t let friends derive drunk.", "An infinite crowd of mathematicians enters a bar. The first one orders a pint... the second one a half pint... the third one a quarter pint… “I understand”... says the bartender – and pours two pints.", "1f u c4n r34d th1s u r34lly n33d t0 g37 l41d.","Theres no place like 127.0.0.1", "Real programmers start counting from 0", "If the box says: 'This software requires Windows 7 or better' Does that mean it'll run on Linux?", "I don't see women as objects. I consider each to be in a class of her own.", "I've got a really good UDP joke to tell you, but i don't know if you'll get it","Chuck Norris can retrieve anything from /dev/null.","No one has ever pair-programmed with Chuck Norris and lived to tell about it.","No one has ever spoken during review of Chuck Norris' code and lived to tell about it.","Chuck Norris doesn't use GUI, he prefers COMMAND line.", "What does a subatomic duck say? Quark.", "Why does a burger have less energy than a steak? A burger is in its ground state.", "Why did I divide sin by tan? Just cos.", "How many theoretical physicists does it take to screw in a light bulb? Two. One to hold the bulb and one to rotate the universe.","Why do fish likes nibbles the size of 2^n? So they can byte", "Chuck Norris can take a screenshot of his blue screen.", "There are only 10 types of people in the world: those that understand binary, those that don’t, and those that didn't expect a ternary joke.", "Programmer (noun.): A machine that turns coffee into code", "Algorith (noun.): Word used by programmers when... they do not want to explain what they did.", "What's the object-oriented way to become wealthy? Inheritance.", "Why did the programmer quit his job? Because he didn't get arrays.", "What do computers and air conditioners have in common? They both become useless when you open windows.", "Why do Java programmers have to wear glasses? Because they don't C#.", "A foo walks into a bar, takes a look around and says \"Hello World!\".", "3 Database SQL walked into a NoSQL bar. A little while later they walked out, because they couldn't find a table.", "UNIX is user friendly, it's just very particular about who it's friends are.", "Why is C sad? Because C++ told him \"You have no class\".","Why are fishes illiterate?Because C doesnt have Classes","Who called it female foeticide and not Binary ?","Le gf: I'll dump you.Le bf: hex dump or binary dump? ","How does a Programmer COok food ? In O(1)","binary digits are called bits i love ternary digits","Yuvraj's Batting- 1 1 0 1 1 1 0 0 1 0 0 1 0 1 0 1 0 1 1 0 W.He has specialization in Digital Electronics.","Why did Microsoft release Windows 10 ( and not windows 9) ?Because 7 8 9","Gotta love the people who wrote the algorithm for Ola share,They go out of their way to help others", "Linux: Born to be root. Windows: Born to re-boot", "I can't access Git. I guess I have... commitment issues", "Don't fart in an Apple Store, because they don't have Windows.", "I have a good joke on Information Technology, but you won't get IT", "Do you have a girlfriend? I will leave the relationship to the databases", "Roses are #ff0000, violets are #0000ff, I use hex codes, but I'd use RGB for you", "Java programmers are some of the most materialistic people I know, very object-oriented", "SON: What are clouds made of? DAD: Linux servers, mostly", "SHE: Are you just gonna sit here on the computer OR are we going out? HE: Yes", "CPU (Coffee Processing Unit)", "I told him I can't open the jar, he said download and install Java","'Knock knock.' 'Who's there?' *10 mins later* 'Java.'","A programmer is having trouble with his keyboard double-pressing. He asks his coworker what he should do. 'Hit it,' he says. The programmer hits it, but nothing changes. His coworker exclaims 'No, really BASH it!'","Why did the chicken cross the road? It was called with theOtherSide(chicken)","How do you tell an introverted computer scientist from an extroverted computer scientist? The extrovert looks at *your* shoes when he talks to you.","Why Do programmers always mix up Haloween and Christmas? Because Oct31 == Dec25.","Why did the programmer die in the shower? The shampoo bottle said: Wash, rinse, repeat.","A UDP packet walks into a bar. The bartender doesn't acknowledge him.","99 Bugs in the Code.  99 Bugs in the Code.  You take one down, patch it around, 127 Bugs in the code"]